import type { Category } from "../CategoriesType";
import type { CategoryType } from "../model/CategoryType";

export default class CategoriesDao {
    static cacheCategories: Array<Category> | undefined

    static getCategories() {
        return new Promise<Array<Category>>((resolve, _) => {
            if (typeof CategoriesDao.cacheCategories != 'undefined') {
                resolve(CategoriesDao.cacheCategories)
            }
            else setTimeout(() => {
                CategoriesDao.cacheCategories = [
                    {
                        "imageUrl": "/img/63919d998959edf19a9c083bdabb9b40617382a1_150_150.jpeg",
                        "title": "Жіноча мода",
                        "slug": "zhinocha-moda"
                    },
                    {
                        "imageUrl": "/img/df81cd59bbbb8337504d4769731e2c077c5f73af_150_150.jpeg",
                        "title": "Чоловіча мода",
                        "slug": "cholovicha-moda"
                    },
                    {
                        "imageUrl": "/img/b2ed67f90eebaa2ccbc33852b70ad18b9b07edd9_150_150.jpeg",
                        "title": "Товари для дому",
                        "slug": "tovary-dlya-domu"
                    },
                    {
                        "imageUrl": "/img/74f8803315d3da8a5589bb1152b1cde9cbbbb7bd_150_150.jpeg",
                        "title": "Електроніка",
                        "slug": "electronika"
                    },
                    {
                        "imageUrl": "/img/28a75eeff86524e7c678278337e2e137166818a2_150_150.jpeg",
                        "title": "Побутова техніка",
                        "slug": "pobutova-tehnika"
                    },
                    {
                        "imageUrl": "/img/40d0584413005d0e0f38aa58acd06a1182636e38_150_150.jpeg",
                        "title": "Чохли та сумки для телефонів",
                        "slug": "chohly-ta-sumky-dlya-telefoniv"
                    },
                    {
                        "imageUrl": "/img/37ab5435b33aac8d8c45838d5a982b8f3cf4d6c4_150_150.jpeg",
                        "title": "Взуття",
                        "slug": "vzuttya"
                    },
                    {
                        "imageUrl": "/img/ad957554e45977c79a5b9c7a4732e49600c638dc_150_150.jpeg",
                        "title": "Краса",
                        "slug": "krasa"
                    },
                    {
                        "imageUrl": "/img/c6c4fdaec669cf20a70f9717ab8b6018c32b28fc_150_150.jpeg",
                        "title": "Здоров'я",
                        "slug": "zdoroviya"
                    },
                    {
                        "imageUrl": "/img/27ff8ba8d1cf3baedf3ddde52d923824cdd1b1f3_150_150.jpeg",
                        "title": "Будівництво та ремонт",
                        "slug": "budivnuctvo-ta-remont"
                    },
                    {
                        "imageUrl": "/img/8b139399170374a080ee674f94c6810d3c5d1d45_150_150.jpeg",
                        "title": "Дитячі товари",
                        "slug": "dutyachi-tovaru"
                    },
                    {
                        "imageUrl": "/img/bd54137abe3f2366e68bda791a2f4f8ef2e91167_150_150.jpeg",
                        "title": "Автомобілі та мотоцикли",
                        "slug": "avtomobili-ta-motociklu"
                    },
                    {
                        "imageUrl": "/img/728393baf49a8e21fa9b11dd1cd439b54d5b62b9_150_150.jpeg",
                        "title": "Хобі та творчість",
                        "slug": "hobi-ta-tvorchist"
                    },
                    {
                        "imageUrl": "/img/02bb5c113c50553ce75ad66b5301910ce8427a8b_150_150.jpeg",
                        "title": "Сумки та валізи",
                        "slug": "symku-ta-valisu"
                    },
                    {
                        "imageUrl": "/img/f2481b4894e5ec3f004a6c3cdbd1c3f57b5ae6ab_150_150.jpeg",
                        "title": "Спорт та відпочинок",
                        "slug": "sport-ta-vidpochunok"
                    },
                    {
                        "imageUrl": "/img/f25166d0b4f905b5b64d76fc369835e48378c466_150_150.jpeg",
                        "title": "Прикраси та біжутерія",
                        "slug": "prukrasu-ta-bizhuteriya"
                    },
                    {
                        "imageUrl": "/img/3ac400979261ead29a88f44baa55eea30912c03e_150_150.jpeg",
                        "title": "Годинники",
                        "slug": "godunnuku"
                    },
                    {
                        "imageUrl": "/img/3fac34a3d159ad26d549b497e0e282dd906e9d86_150_150.jpeg",
                        "title": "Товари для тварин",
                        "slug": "tovaru-dlya-tvarun"
                    },
                    {
                        "imageUrl": "/img/30406bc01727578d761227ec704aa9fdb70d9ce8_150_150.jpeg",
                        "title": "Дача, сад та город",
                        "slug": "dacha-sad-ta-gorod"
                    },
                    {
                        "imageUrl": "/img/ad62f7f55f1dd238605672f25a3345139ddc091d_150_150.jpeg",
                        "title": "Канцелярія",
                        "slug": "kancelyariya"
                    },
                    {
                        "imageUrl": "/img/b09976ca9b3414bba6c3f5ec85957b7eddc3c197_150_150.jpeg",
                        "title": "Вибрані смартфони",
                        "slug": "vubrani-smartfonu"
                    },
                    {
                        "imageUrl": "/img/91d32a5e6136df7a954d791ce491703edb98a2b6_150_150.jpeg",
                        "title": "Іграшки та ігри",
                        "slug": "igrashku-ta-igru"
                    },
                    {
                        "imageUrl": "/img/e1336f1d621350a3c73e511f6fe8e602eb92d52b_150_150.jpeg",
                        "title": "Свята",
                        "slug": "svyata"
                    },
                    {
                        "imageUrl": "/img/264a9e9c7ddc9b65bd71dff9e7473e56e8be6b9c_150_150.jpeg",
                        "title": "Xiaomi",
                        "slug": "xiaomi"
                    },
                    {
                        "imageUrl": "/img/bff3503892bb9a2c735f7f728966c7cf92c1bed4_150_150.jpeg",
                        "title": "K-pop",
                        "slug": "k-pop"
                    },
                    {
                        "imageUrl": "/img/3c89a51eb2702c72fd5bfa9018b243af1a5bcb42_150_150.jpeg",
                        "title": "Книги",
                        "slug": "knugu"
                    }
                ]
                resolve(CategoriesDao.cacheCategories)
            }, 300)
        })
    }

    static getCategory(slug: string) {
        return new Promise<CategoryType>((resolve, reject) => {
            setTimeout(() => {
                switch (slug) {
                    case 'zhinocha-moda': resolve(({
                        products: [
                            {
                                id: "4",
                                name: "Фланелеві штани для сну на Хелловін з котиком для жінок - Теплий вельвет, повсякденний одяг для осені та зими",
                                slug: "4",
                                price: 371,
                                rating: 4.5,
                                reviewAmount: 111,
                                imgUrl: "/img/7e6ed7fe3f06572479e257a330ed85eb536e261a_400_400.jpeg",
                                description: `Відчуйте затишний шарм сезону в цих теплих вельветових штанах для сну, ідеальних для осіннього та зимового відпочинку.. Ці штани, виготовлені повністю з м'якої фланелі, мають чарівний дизайн з котиком, додаючи грайливий акцент до вашої колекції повсякденного одягу.. Ідеальні для прохолодних ночей або розслаблених вихідних, вони пропонують комфорт і стиль, забезпечуючи вам тепло та модний вигляд протягом холодніших місяців.
                                                Назва тканини: Фланель  
                                                Основний склад тканини: Поліестерне волокно (поліестер)  
                                                Товщина тканини (вага): Товстий (201-250 г/м2)  
                                                Довжина штанів: штани  
                                                Основний вміст тканини: 90% (Включно) - 95% (ексклюзивний)
                                                Країна виробник: Китай
                                                Інструкції включені: Ні

                                                розмір: М, довжина: 95 см, стегна: 98см, Отвір для ніг: 47см, Стегно: 56см.
                                                розмір: L, довжина: 97 см, стегна: 102см, відкриття ноги: 48.5см, Стегно: 58см.
                                                розмір: XL, довжина: 99см, Стегна: 106см, відкриття ноги: 50см, стегно: 60см.
                                                розмір: 2XL, довжина: 101 см, стегна: 110см, відкриття ноги: 51.5см, стегно: 62см.

                                                materialForFur: фланель`,
                                reviews: [
                                    {
                                        name: "Олена",
                                        message: "Дуже якісний товар, приємний матеріал і швидка доставка. Рекомендую!",
                                        stars: 5
                                    },
                                    {
                                        name: "Ірина",
                                        message: "Все відповідає опису. Трішки довга доставка, але загалом задоволена.",
                                        stars: 4
                                    },
                                    {
                                        name: "Марія",
                                        message: "Гарний товар за свою ціну. Купила вдруге — все супер.",
                                        stars: 5
                                    },
                                    {
                                        name: "Катерина",
                                        message: "Якість нормальна, але очікувала трохи кращого. Все ж непогано.",
                                        stars: 4
                                    },
                                    {
                                        name: "Наталія",
                                        message: "Сподобалось! Виглядає так само, як на фото. Буду замовляти ще.",
                                        stars: 5
                                    }
                                ]
                            },
                            {
                                id: "5",
                                name: "Затишні мультяшні тапочки з великими очима: Тепла пухнаста бавовна для пар взимку",
                                slug: "5",
                                price: 321,
                                rating: 4.9,
                                reviewAmount: 27,
                                imgUrl: "/img/0db58442f21321642b006e34f3b980322dd8af5c_400_400.jpeg",
                                description: `Ці чудові тапочки мають чарівний малюнок мультяшної собаки з великими очима, ідеально підходять для додавання веселого штриха до вашого зимового кімнатного гардеробу. Виготовлені з м’якою бавовняною внутрішньою частиною, вони гарантують, що вашим ногам буде тепло та затишно в холодні місяці. Замшевий верхній матеріал підвищує їхню довговічність і пропонує нотку розкоші, а підошва EVA забезпечує чудове зчеплення та комфорт. Ідеальні для пар, ці химерні тапочки обіцяють зробити ваш відпочинок приємним і стильним.
Матеріал підошви: EVA  
Відповідна стать: Унісекс/для чоловіків і жінок  
Функція: Протиковзкий, Зберігає тепло, Зносостійкий  
Товщина: Нормальний товщина  
Верхній матеріал: Замша  
Відповідний тип людей: Пара  
Технологія підошви: Швейне взуття  
Стиль: Мультфільм  
Форма: Баотоу  
Матеріал проміжної підошви: Середня підошва PHYLON (вторинне спінювання,)  
Товщина підошви: 3,5 см і вище  
Відповідна вікова група: Дорослий
Країна виробник: Китай
Інструкції включені: Ні

soleMaterial: evaSole
взуттяUpperMaterial: замша`
                            },
                            {
                                id: "6",
                                name: "1 пара світлових шнурків для чоловіків, жінок, шнурків для взуття, що світяться, люмінесцентних світлодіодів, для кросівок, парусинових туфель, довжиною ниток 80 см/100 см/120 см/140 см",
                                slug: "6",
                                price: 41,
                                rating: 4.8,
                                reviewAmount: 206,
                                imgUrl: "/img/bedcccc1de3e34e29a7e0128249b5410e911d063_400_400.jpeg"
                            },
                            {
                                id: "7",
                                name: "Yogodlns Жіноча сумка зі штучного хутра. Зимова плюшева сумка через плече. Пухнаста сумка-мессенджер. Жіночі м’які пухнасті сумочки. Сумка для шопперів.",
                                slug: "7",
                                price: 483,
                                rating: 4.3,
                                reviewAmount: 4201,
                                imgUrl: "/img/2f716b2872dcb3d55fcf12830c5a106581fb2215_400_400.jpeg"
                            },
                            {
                                id: "8",
                                name: "Bison Denim Модний жіночий гаманець для кредитної картки з натуральної шкіри, жіночий гаманець великої місткості на подвійній блискавці",
                                slug: "8",
                                price: 206,
                                rating: 4.6,
                                reviewAmount: 110,
                                imgUrl: "/img/5458c368f45162a4d180c80e1d6f5ae974788fea_400_400.jpeg"
                            },
                            {
                                id: "9",
                                name: "Нове міні-зелене кільце з деревною жабою Жаба, відкриті каблучки для жінок, чоловіків, металеві милі тварини, регульоване кільце для пальців, ювелірні вироби, подарунок на день народження",
                                slug: "9",
                                price: 46,
                                rating: 4.8,
                                reviewAmount: 414,
                                imgUrl: "/img/4c427f94f972a708811bb883912c9fb158a3c60f_400_400.jpeg"
                            },
                            {
                                id: "10",
                                name: "Висока якість 9 кольорів M-3XL Однотонна футболка Жіночі бавовняні еластичні базові футболки Жіночі повсякденні топи Футболка з коротким рукавом Жіноча 2024",
                                slug: "10",
                                price: 357,
                                rating: 4.8,
                                reviewAmount: 654,
                                imgUrl: "/img/858dc28fa6475d949c9de5c5ecb6d6bf24122057_400_400.jpeg"
                            },
                            {
                                id: "11",
                                name: "1 пара шкарпеток на п'ять пальців Нові бавовняні жіночі спортивні шкарпетки з низьким вирізом",
                                slug: "11",
                                price: 67,
                                rating: 4.7,
                                reviewAmount: 5000,
                                imgUrl: "/img/39bf06617dc01616188d17b2669ccda736eafc72_400_400.jpeg"
                            },
                            {
                                id: "12",
                                name: "Жіноче коротке зимове пальто унісекс з молочним пухом – вільне, товсте, модний великий розмір",
                                slug: "12",
                                price: 1607,
                                rating: 4.6,
                                reviewAmount: 18,
                                imgUrl: "/img/563515ed7e0d1e7d16da111252a907282fa9dc22_400_400.jpeg"
                            },
                            {
                                id: "1",
                                name: "Нові старовинні прозорі комп'ютерні окуляри в оправі для жінок і чоловіків, окуляри проти синього світла, окуляри, оптичні окуляри",
                                slug: "1",
                                price: 48,
                                rating: 4.7,
                                reviewAmount: 3001,
                                imgUrl: "/img/2506069c78bcba478272fb8ce9f04c54eb825ec7_400_400.jpeg"
                            },
                            {
                                id: "2",
                                name: "Розкішні діамантові окуляри для читання Нові модні окуляри далекого зору для жінок, чоловіків, окуляри для пресбіопії, що блокують синє світло +1,0+1,5+4,0",
                                slug: "2",
                                price: 48,
                                rating: 4.7,
                                reviewAmount: 3001,
                                imgUrl: "/img/eba85193816c5de408e0e74d9b8544edc08484c9_400_400.jpeg"
                            },
                            {
                                id: "3",
                                name: "Шикарні жіночі сітчасті шкарпетки з леопардовим принтом - 1 упаковка: Легкий, міцний і м’який, підвищить ваш стиль і комфорт",
                                slug: "3",
                                price: 52,
                                rating: 4.6,
                                reviewAmount: 1001,
                                imgUrl: "/img/e3a50d722b4a2ec5c0c522543102ad15d0039ab0_400_400.jpeg"
                            },
                        ]
                    })); break;
                    case 'cholovicha-moda': resolve(({
                        products: [
                            {
                                id: "13",
                                name: "Фланелеві штани для сну на Хелловін з котиком для жінок - Теплий вельвет, повсякденний одяг для осені та зими",
                                slug: "13",
                                price: 143,
                                rating: 4.4,
                                reviewAmount: 36,
                                imgUrl: "/img/7a14989591e9527608c76c5f5e41cbec7009d96c_400_400.jpeg"
                            },
                            {
                                id: "14",
                                name: "Чоловічі берети Льняний капелюх газетник Жіночий берет із льону Старовинні чоловічі берети Французькі капелюхи Темно-синя кепка",
                                slug: "14",
                                price: 201,
                                rating: 4.2,
                                reviewAmount: 10000,
                                imgUrl: "/img/0c538270c3bdef4bedf2684ff768475f9e93cf1d_400_400.jpeg"
                            },
                            {
                                id: "15",
                                name: "Чоловічий светр з високим горлом, однотонний пуловер з високим горлом, в’язані светри, повсякденні еластичні светри, чоловічі осінь-зима",
                                slug: "15",
                                price: 518,
                                rating: 4.3,
                                reviewAmount: 2000,
                                imgUrl: "/img/6b23e2406d0a97d78e0c515fafe010329ceae429_400_400.jpeg"
                            },
                            {
                                id: "16",
                                name: "Чоловічий кашеміровий шарф, звичайний чистий колір, шалі з пашміни, шарфи",
                                slug: "16",
                                price: 187,
                                rating: 4.5,
                                reviewAmount: 2000,
                                imgUrl: "/img/99138bb2d87f6a9a00bc357a18f645b9f6bc6db4_400_400.jpeg"
                            },
                            {
                                id: "17",
                                name: "Чоловічий ремінь, пряжка зі сплаву, дихаючі еластичні ремені для чоловіків, дизайнерський ковбойський ремінь, тактичний ремінь, військові подарунки",
                                slug: "17",
                                price: 121,
                                rating: 4.4,
                                reviewAmount: 429,
                                imgUrl: "/img/c327f4a248a6ed35ad2e5a076ef2e2b1ec8c587b_400_400.jpeg"
                            },
                            {
                                id: "18",
                                name: "Осінньо-зимова в'язана вовняна шкіра дині, модна хіп-хоп шапка",
                                slug: "18",
                                price: 4.5,
                                rating: 4.5,
                                reviewAmount: 8000,
                                imgUrl: "/img/12dd3952bfca420f7a6fd5a102384bd4a7535ebf_400_400.jpeg"
                            },
                            {
                                id: "19",
                                name: "Весняна мода 2024 р. Чоловічі толстовки з капюшоном Повсякденні толстовки Пуловери Світшоти Чоловічі однотонні толстовки з капюшоном Чоловічий світшот",
                                slug: "19",
                                price: 458,
                                rating: 4.2,
                                reviewAmount: 941,
                                imgUrl: "/img/3e8a20876d9466ac97e2b21f379a9af2dfa03995_400_400.jpeg"
                            },
                            {
                                id: "20",
                                name: "Чоловіча сумка через плече Оксфордська тканина Повсякденна дорожня сумка через плече великої місткості Середнього віку маленька квадратна сумка Сумка для інструментів",
                                slug: "20",
                                price: 267,
                                rating: 4.5,
                                reviewAmount: 3000,
                                imgUrl: "/img/a66bc43e47dfae93bbafa4f94fdf9cf62b478148_400_400.jpeg"
                            },
                            {
                                id: "21",
                                name: "1 пара вовняних устілок Чоловіки Жінки Зима Зберігає тепло Устілка М’яка вовна Потовщена підкладка для взуття Взуття Термічні подушечки для взуття",
                                slug: "21",
                                price: 72,
                                rating: 4.8,
                                reviewAmount: 1500,
                                imgUrl: "/img/9fd9a149b5705b6c4de3b0646eb48a6ab2b4fe30_400_400.jpeg"
                            },
                            {
                                id: "22",
                                name: "Новий Спеціальний Унікальний Крутий 3d Чохол у Формі Пістолета для iPhone 7 Plus з Матеріалів Преміум Якості",
                                slug: "22",
                                price: 239,
                                rating: 5.0,
                                reviewAmount: 210,
                                imgUrl: "/img/ecd7906137f07246d3d1dac325f7eabae1c32f10_400_400.jpeg"
                            },
                            {
                                id: "23",
                                name: "Ремінець для окулярів Шнур для спортивних окулярів Сонцезахисні окуляри Тримач для мотузки Струна",
                                slug: "23",
                                price: 23,
                                rating: 4.6,
                                reviewAmount: 6000,
                                imgUrl: "/img/fcbfed97fc71cb84cfdedb084e419026f8d3bbec_400_400.jpeg"
                            },
                            {
                                id: "24",
                                name: "Милі Бавовняні Шкарпетки з Сердечком Жіночі Літні Модні Чорно-Білі Спортивні Короткі Шкарпетки Дівчачі Милий Стиль Низькі Шкарпетки-Човники",
                                slug: "24",
                                price: 33,
                                rating: 4.7,
                                reviewAmount: 866,
                                imgUrl: "/img/5de0529645e4f9990db4116bdc84ecf4426d80a9_original.jpeg"
                            }
                        ]
                    })); break;
                    case 'tovary-dlya-domu': resolve(({
                        products: [
                            {
                                id: "25",
                                name: "Потужна міні-швабра Складані швабри для дому з губкою Самовіджимаючі швабри для миття підлоги Інструменти для чищення столу, вікна автомобіля",
                                slug: "25",
                                price: 160,
                                rating: 4.5,
                                reviewAmount: 30000,
                                imgUrl: "/img/2c76264b81c3462dc63efe2ebbc61e7c87aac524_400_400.jpeg"
                            },
                            {
                                id: "26",
                                name: "Овочечистка з нержавіючої сталі Багатофункціональна картоплечистка Нарізка для фруктів і картоплі Подрібнювач овочів для кухонних аксесуарів Інструменти для приготування їжі",
                                slug: "26",
                                price: 42,
                                rating: 4.4,
                                reviewAmount: 20000,
                                imgUrl: "/img/a314080789a6adadb05239da6932b3c250743c40_400_400.jpeg"
                            },
                            {
                                id: "27",
                                name: "1/3/5/10 шт. Прищіпки з нержавіючої сталі з гачком. Організатор для білизни. Портативна кліпса. Вішалка для шафи. Ефективне керування одягом.",
                                slug: "27",
                                price: 32,
                                rating: 4.8,
                                reviewAmount: 1500,
                                imgUrl: "/img/5bab230d43e61dda42327c045cee095b109cd37c_400_400.jpeg"
                            },
                            {
                                id: "28",
                                name: "Антипригарний килимок для пароварки Dim Sum Tool Харчовий силікон багаторазового використання Ресторан Кухня під килимком для пароварки Кухонні аксесуари для приготування їжі",
                                slug: "28",
                                price: 32,
                                rating: 4.8,
                                reviewAmount: 30000,
                                imgUrl: "/img/8c2730cfd220552ed308d654199d048d7a6df870_400_400.jpeg"
                            },
                            {
                                id: "29",
                                name: "Блакитна м'яка чарівна губка Гумка для чищення ванни Засіб для чищення керамічної плитки Кухонний інструмент",
                                slug: "29",
                                price: 78,
                                rating: 4.5,
                                reviewAmount: 10000,
                                imgUrl: "/img/96cd5bdc8fa095b43ab35a48cc44ecb78f402153_400_400.jpeg"
                            },
                            {
                                id: "30",
                                name: "Лопатка для вершкового масла з нержавіючої сталі Лопатки для варення для сиру Десерт Лопатки для крему Столові прилади для тостів з мармеладу Хлібні лопатки для нанесення масла",
                                slug: "30",
                                price: 54,
                                rating: 4.9,
                                reviewAmount: 10000,
                                imgUrl: "/img/9615a9662abad41f7c4199c8f01474485d4ea158_400_400.jpeg"
                            },
                            {
                                id: "31",
                                name: "Щітка для чищення клавіатури, що згинається, Щітка для зазорів пазів",
                                slug: "31",
                                price: 24,
                                rating: 4.7,
                                reviewAmount: 20000,
                                imgUrl: "/img/82f22fc060c261bd24367687d10570ec2a91cd29_400_400.jpeg"
                            },
                            {
                                id: "32",
                                name: "Сепаратор яєчного білка",
                                slug: "32",
                                price: 28,
                                rating: 4.8,
                                reviewAmount: 3000,
                                imgUrl: "/img/aaf499bc6b326793f0c91387014aa7347a59ad04_400_400.jpeg"
                            },
                            {
                                id: "33",
                                name: "Каструля з нержавіючої сталі преміум-класу для гарячого соусу з гарячою олією та розтоплення масла",
                                slug: "33",
                                price: 133,
                                rating: 4.5,
                                reviewAmount: 4000,
                                imgUrl: "/img/708725f68c84e33b566e075e45c9cd2da18b2493_400_400.jpeg"
                            },
                            {
                                id: "34",
                                name: "Панель із нержавіючої сталі та обробна дошка Кухня Побутова потовщена двостороння обробна дошка Блок дошки для замішування тіста",
                                slug: "34",
                                price: 249,
                                rating: 4.7,
                                reviewAmount: 3000,
                                imgUrl: "/img/5481e174f8e08473a5990d541850fc1f8d5a8889_400_400.jpeg"
                            },
                            {
                                id: "35",
                                name: "100PCS 3 розмірів мішків для зберігання харчових продуктів з ручкою Keep Fresh Transpare Roll Свіжі поліетиленові пакети з вакуумної сумки Food Saver Bag",
                                slug: "35",
                                price: 120,
                                rating: 4.7,
                                reviewAmount: 8000,
                                imgUrl: "/img/d428b5a6da58f33944327b7e9b4167b5c10240d6_400_400.jpeg"
                            },
                            {
                                id: "36",
                                name: "1 шт. Лимон Лаванда Троянда Османтус Освіжувачі повітря Натуральні ароматизатори Підвісний мішечок для спецій Шафа Дезодоруючий папір Пакетик Шафа",
                                slug: "36",
                                price: 35,
                                rating: 4.4,
                                reviewAmount: 6000,
                                imgUrl: "/img/f4cc203663033afa3e4028bed5119f6c317a8e7e_400_400.jpeg"
                            }
                        ]
                    })); break;
                    default: reject('"Slug not found')
                }
            }, 300)
        })
    }
}