import type { ProductType } from "../model/ProductType";

export default class ProductDao {
    static getProduct(slugOrId: string): Promise<ProductType> {
        return new Promise((resolve, reject) => {
            setTimeout(() => {
                switch (slugOrId) {
                    case "1":
                        resolve({
                            id: "1",
                            name: "Нові старовинні прозорі комп'ютерні окуляри в оправі для жінок і чоловіків, окуляри проти синього світла, окуляри, оптичні окуляри",
                            slug: "1",
                            price: 48,
                            rating: 4.7,
                            reviewAmount: 3001,
                            imgUrl: "/img/2506069c78bcba478272fb8ce9f04c54eb825ec7_400_400.jpeg"
                        });
                        break;

                    case "2":
                        resolve({
                            id: "2",
                            name: "Розкішні діамантові окуляри для читання Нові модні окуляри далекого зору для жінок, чоловіків, окуляри для пресбіопії, що блокують синє світло +1,0+1,5+4,0",
                            slug: "2",
                            price: 48,
                            rating: 4.7,
                            reviewAmount: 3001,
                            imgUrl: "/img/eba85193816c5de408e0e74d9b8544edc08484c9_400_400.jpeg"
                        });
                        break;

                    case "3":
                        resolve({
                            id: "3",
                            name: "Шикарні жіночі сітчасті шкарпетки з леопардовим принтом - 1 упаковка: Легкий, міцний і м’який, підвищить ваш стиль і комфорт",
                            slug: "3",
                            price: 52,
                            rating: 4.6,
                            reviewAmount: 1001,
                            imgUrl: "/img/e3a50d722b4a2ec5c0c522543102ad15d0039ab0_400_400.jpeg"
                        });
                        break;

                    case "4":
                        resolve({
                            id: "4",
                            name: "Фланелеві штани для сну на Хелловін з котиком для жінок - Теплий вельвет, повсякденний одяг для осені та зими",
                            slug: "4",
                            price: 371,
                            rating: 4.5,
                            reviewAmount: 111,
                            imgUrl: "/img/7e6ed7fe3f06572479e257a330ed85eb536e261a_400_400.jpeg",
                            description: 
                             `Відчуйте затишний шарм сезону в цих теплих вельветових штанах для сну, 
ідеальних для осіннього та зимового відпочинку.. 
Ці штани, виготовлені повністю з м'якої фланелі, мають чарівний 
дизайн з котиком, 
додаючи грайливий акцент до вашої колекції повсякденного одягу.. 
Ідеальні для прохолодних ночей або розслаблених вихідних, 
вони пропонують комфорт і стиль, 
забезпечуючи вам тепло та модний вигляд протягом холодніших місяців.

Назва тканини: Фланель  
Основний склад тканини: Поліестерне волокно (поліестер)  
Товщина тканини (вага): Товстий (201-250 г/м2)  
Довжина штанів: штани  
Основний вміст тканини: 90% (Включно) - 95% (ексклюзивний)
Країна виробник: Китай

Інструкції включе
розмір: М, довжина: 95 см, стегна: 98см, Отвір для ніг: 47см, Стегно: 56см.
розмір: L, довжина: 97 см, стегна: 102см, відкриття ноги: 48.5см, Стегно: 58см.
розмір: XL, довжина: 99см, Стегна: 106см, відкриття ноги: 50см, стегно: 60см.
розмір: 2XL, довжина: 101 см, стегна: 110см, відкриття ноги: 51.5см, стег
materialForFur: фланель`,
                            reviews: [
                                {
                                    name: "Олена",
                                    message: "Дуже якісний товар, приємний матеріал і швидка доставка. Рекомендую!",
                                    stars: 5
                                },
                                {
                                    name: "Ірина",
                                    message: "Все відповідає опису. Трішки довга доставка, але загалом задоволена.",
                                    stars: 4
                                },
                                {
                                    name: "Марія",
                                    message: "Гарний товар за свою ціну. Купила вдруге — все супер.",
                                    stars: 5
                                },
                                {
                                    name: "Катерина",
                                    message: "Якість нормальна, але очікувала трохи кращого. Все ж непогано.",
                                    stars: 4
                                },
                                {
                                    name: "Наталія",
                                    message: "Сподобалось! Виглядає так само, як на фото. Буду замовляти ще.",
                                    stars: 5
                                }
                            ]
                        });
                        break;

                    case "5":
                        resolve({
                            id: "5",
                            name: "Затишні мультяшні тапочки з великими очима: Тепла пухнаста бавовна для пар взимку",
                            slug: "5",
                            price: 321,
                            rating: 4.9,
                            reviewAmount: 27,
                            imgUrl: "/img/0db58442f21321642b006e34f3b980322dd8af5c_400_400.jpeg",
                            description: `Круті Юмовскі тапки різних розмірів але одного стану, 
найкращий вибір взуття в вашому житті, купуйте плакати не будете`,
                            reviews: [
                                {
                                    name: "Олена",
                                    message: "Дуже якісний товар, приємний матеріал і швидка доставка. Рекомендую!",
                                    stars: 5
                                },
                                {
                                    name: "Ірина",
                                    message: "Все відповідає опису. Трішки довга доставка, але загалом задоволена.",
                                    stars: 4
                                },
                                {
                                    name: "Марія",
                                    message: "Гарний товар за свою ціну. Купила вдруге — все супер.",
                                    stars: 5
                                },
                                {
                                    name: "Катерина",
                                    message: "Якість погана, очікувала кращого. Все ж непогано.",
                                    stars: 2
                                },
                                {
                                    name: "Наталія",
                                    message: "Сподобалось! Виглядає так само, як на фото. Буду замовляти ще.",
                                    stars: 5
                                }
                            ]
                        });
                        break;
                    case "6":
                        resolve({
                            id: "6",
                            name: "1 пара світлових шнурків для чоловіків, жінок, шнурків для взуття, що світяться, люмінесцентних світлодіодів, для кросівок, парусинових туфель, довжиною ниток 80 см/100 см/120 см/140 см",
                            slug: "6",
                            price: 41,
                            rating: 4.8,
                            reviewAmount: 206,
                            imgUrl: "/img/bedcccc1de3e34e29a7e0128249b5410e911d063_400_400.jpeg",
                            description: `Круті Юмовскі шнурки різних розмірів але одного стану, 
найкращий вибір шеурків в вашому житті, купуйте плакати не будете

50см.
79смю
100см.
120см.`,
                            reviews: [
                                {
                                    name: "Олена",
                                    message: "Дуже якісний товар, приємний матеріал і швидка доставка. Рекомендую!",
                                    stars: 5
                                },
                                {
                                    name: "Ірина",
                                    message: "Все відповідає опису. Трішки довга доставка, але загалом задоволена.",
                                    stars: 4
                                },
                                {
                                    name: "Марія",
                                    message: "Гарний товар за свою ціну. Купила вдруге — все супер.",
                                    stars: 5
                                },
                                {
                                    name: "Катерина",
                                    message: "Якість нормальна, але очікувала трохи кращого. Все ж непогано.",
                                    stars: 4
                                },
                                {
                                    name: "Наталія",
                                    message: "Сподобалось! Виглядає так само, як на фото. Буду замовляти ще.",
                                    stars: 5
                                }
                            ]
                        });
                        break;

                    case "7":
                        resolve({
                            id: "7",
                            name: "Yogodlns Жіноча сумка зі штучного хутра. Зимова плюшева сумка через плече. Пухнаста сумка-мессенджер. Жіночі м’які пухнасті сумочки. Сумка для шопперів.",
                            slug: "7",
                            price: 483,
                            rating: 4.3,
                            reviewAmount: 4201,
                            imgUrl: "/img/2f716b2872dcb3d55fcf12830c5a106581fb2215_400_400.jpeg",
                            description: `Крута Юмовска сумка одного розміру і одного стану, 
найкращий вибір сумки в вашому житті, купуйте плакати не будете`,
                            reviews: [
                                {
                                    name: "Олена",
                                    message: "Дуже якісний товар, приємний матеріал і швидка доставка. Рекомендую!",
                                    stars: 5
                                },
                                {
                                    name: "Ірина",
                                    message: "Все відповідає опису. Трішки довга доставка, але загалом задоволена.",
                                    stars: 4
                                },
                                {
                                    name: "Марія",
                                    message: "Гарний товар за свою ціну. Купила вдруге — все супер.",
                                    stars: 5
                                },
                                {
                                    name: "Катерина",
                                    message: "Якість нормальна, але очікувала трохи кращого. Все ж непогано.",
                                    stars: 4
                                },
                                {
                                    name: "Наталія",
                                    message: "Сподобалось! Виглядає так само, як на фото. Буду замовляти ще.",
                                    stars: 5
                                }
                            ]
                        });
                        break;

                    case "8":
                        resolve({
                            id: "8",
                            name: "Bison Denim Модний жіночий гаманець для кредитної картки з натуральної шкіри, жіночий гаманець великої місткості на подвійній блискавці",
                            slug: "8",
                            price: 206,
                            rating: 4.6,
                            reviewAmount: 110,
                            imgUrl: "/img/5458c368f45162a4d180c80e1d6f5ae974788fea_400_400.jpeg"
                        });
                        break;

                    case "9":
                        resolve({
                            id: "9",
                            name: "Нове міні-зелене кільце з деревною жабою Жаба, відкриті каблучки для жінок, чоловіків, металеві милі тварини, регульоване кільце для пальців, ювелірні вироби, подарунок на день народження",
                            slug: "9",
                            price: 46,
                            rating: 4.8,
                            reviewAmount: 414,
                            imgUrl: "/img/4c427f94f972a708811bb883912c9fb158a3c60f_400_400.jpeg"
                        });
                        break;

                    case "10":
                        resolve({
                            id: "10",
                            name: "Висока якість 9 кольорів M-3XL Однотонна футболка Жіночі бавовняні еластичні базові футболки Жіночі повсякденні топи Футболка з коротким рукавом Жіноча 2024",
                            slug: "10",
                            price: 357,
                            rating: 4.8,
                            reviewAmount: 654,
                            imgUrl: "/img/858dc28fa6475d949c9de5c5ecb6d6bf24122057_400_400.jpeg"
                        });
                        break;

                    case "11":
                        resolve({
                            id: "11",
                            name: "1 пара шкарпеток на п'ять пальців Нові бавовняні жіночі спортивні шкарпетки з низьким вирізом",
                            slug: "11",
                            price: 67,
                            rating: 4.7,
                            reviewAmount: 5000,
                            imgUrl: "/img/39bf06617dc01616188d17b2669ccda736eafc72_400_400.jpeg"
                        });
                        break;

                    case "12":
                        resolve({
                            id: "12",
                            name: "Жіноче коротке зимове пальто унісекс з молочним пухом – вільне, товсте, модний великий розмір",
                            slug: "12",
                            price: 1607,
                            rating: 4.6,
                            reviewAmount: 18,
                            imgUrl: "/img/563515ed7e0d1e7d16da111252a907282fa9dc22_400_400.jpeg"
                        });
                }

            }, 300)
        });
    }
}